In [1]:
%load_ext sql

In [2]:
%sql sqlite:///library.db

'Connected: @library.db'

In [3]:
%%sql
PRAGMA foreign_keys=1;

 * sqlite:///library.db
Done.

[]

In [4]:
%%sql

CREATE TABLE Person(
    person_id VARCHAR(255)  PRIMARY KEY,
    first_name VARCHAR(255),
    last_name VARCHAR(255),
    address1 VARCHAR(255),
    address2 VARCHAR(255),
    city VARCHAR(255),
    state CHAR(2),
    zipCode CHAR(10),
    phone VARCHAR(14) DEFAULT 'unlisted',
    email VARCHAR(255) CHECK (email LIKE '%@%'),
    gender CHAR(1) CHECK (gender IN ('F', 'M','O')) ,
    member_type VARCHAR(255) DEFAULT 'Undergraduate', 
    mem_startdate DATE, 
    mem_enddate DATE, 
    allow_borrow INT CHECK (allow_borrow IN (1, 0))    
    CHECK(address1 IS NOT NULL AND address1 <> address2)
);

CREATE TABLE Item(
    item_id VARCHAR(255)  PRIMARY KEY,
    title VARCHAR(255),
    cat_name VARCHAR(50) DEFAULT 'Others',
    pub_date DATE,
    availability  INT CHECK (availability IN (1, 0)) ,
    shelf_num VARCHAR(255) ,
    borrow_date DATE ,
    due_date DATE ,
    return_date DATE ,
    person_id VARCHAR(255)  REFERENCES Person
);
 
CREATE TABLE Books(
    edition VARCHAR(10),
    item_id VARCHAR(255)  PRIMARY KEY,
    online INT CHECK (online IN (1, 0)) ,
    FOREIGN KEY ('item_id') REFERENCES Item ('item_id') ON DELETE CASCADE ON UPDATE CASCADE
);

 CREATE TABLE Personnel(
    job_startdate DATE,
    job_enddate DATE,
    person_id VARCHAR(255)  PRIMARY KEY,
    FOREIGN KEY ('person_id') REFERENCES Person ('person_id') ON DELETE RESTRICT ON UPDATE CASCADE
);

CREATE TABLE Periodicals(
    volume VARCHAR(10),
    issue INT,
    item_id VARCHAR(255)  PRIMARY KEY,
    online INT CHECK (online IN (1, 0)) ,
    FOREIGN KEY ('item_id') REFERENCES Item ('item_id') ON DELETE CASCADE ON UPDATE CASCADE
);

CREATE TABLE Audiovisuals(
    medium VARCHAR(255) DEFAULT 'CD',
    item_id VARCHAR(255)  PRIMARY KEY,
    FOREIGN KEY ('item_id') REFERENCES Item ('item_id') ON DELETE CASCADE ON UPDATE CASCADE
);

CREATE TABLE Artist(
    artist_id VARCHAR(255) PRIMARY KEY,
    artist_name VARCHAR(255)
    );

CREATE TABLE Author(
    author_id VARCHAR(255) PRIMARY KEY,
    first_name VARCHAR(255),
    last_name VARCHAR(255)
    );

CREATE TABLE Publisher(
    publisher_id VARCHAR(255) PRIMARY KEY,
    publisher_name VARCHAR(255)
    );

CREATE TABLE Producer(
    producer_id VARCHAR(255) PRIMARY KEY,
    producer_name VARCHAR(255)
    );

CREATE TABLE Volunteer_options(
    vol_name VARCHAR(255) PRIMARY KEY,
    vol_type VARCHAR (255) DEFAULT 'Others',
    activity_desc VARCHAR (255),
    hours_week INT DEFAULT 10
    
);

CREATE TABLE Help(
    help_id INT PRIMARY KEY,
    help_type VARCHAR (100) DEFAULT 'Others',
    help_desc VARCHAR (255) ,
    is_urgent INT CHECK (is_urgent IN (1, 0)) ,
    person_id VARCHAR(255) REFERENCES Person
);

CREATE TABLE Event(
    event_name VARCHAR (255) PRIMARY KEY,
    event_type VARCHAR (255) DEFAULT 'Others', 
    event_desc VARCHAR (255), 
    date DATE ,
    time TIME, 
    audience VARCHAR (100) DEFAULT 'Everyone',
    has_food INT CHECK ( has_food IN (1, 0)) ,
    room_number VARCHAR (255) REFERENCES Location

);

CREATE TABLE Location(
    floor INT,
    room_number VARCHAR (100) PRIMARY KEY

 );

CREATE TABLE New_items(
    new_id INT PRIMARY KEY, 
    new_title VARCHAR(255),
    cat_name VARCHAR(50) DEFAULT 'Others',
    person_id VARCHAR (255) REFERENCES Person('person_id'),
    desc VARCHAR (255),
    condition VARCHAR (50) DEFAULT 'Good'
);


CREATE TABLE Organizer(
    organizer_name VARCHAR (255), 
    organizer_email VARCHAR (255) UNIQUE CHECK (organizer_email LIKE '%@%'),
    PRIMARY KEY (organizer_email)
     );

CREATE TABLE Register(
    event_name VARCHAR (255) NOT NULL,
    person_id VARCHAR(255) NOT NULL,
    PRIMARY KEY ( event_name, person_id),
    FOREIGN KEY ( event_name) REFERENCES Event( event_name) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (person_id) REFERENCES Person(person_id) ON DELETE CASCADE ON UPDATE CASCADE
    );

CREATE TABLE Volunteer(
    vol_name VARCHAR (255) NOT NULL,
    person_id VARCHAR(255) NOT NULL,
    PRIMARY KEY (vol_name, person_id),
    FOREIGN KEY (vol_name) REFERENCES Volunteer_options(vol_name) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (person_id) REFERENCES Person(person_id) ON DELETE CASCADE ON UPDATE CASCADE
    );

CREATE TABLE Fines_on(
    item_id VARCHAR (255) NOT NULL,
    person_id VARCHAR(255) NOT NULL,
    fine_date DATE NOT NULL,
    fine_amount FLOAT, 
    fine_payed FLOAT DEFAULT 0,
    PRIMARY KEY (person_id,item_id,fine_date),
    FOREIGN KEY (item_id) REFERENCES Item(item_id) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (person_id) REFERENCES Person(person_id) ON DELETE RESTRICT ON UPDATE CASCADE
    );

CREATE TABLE items_of_author(
    author_id VARCHAR (255) NOT NULL,
    item_id VARCHAR(255) NOT NULL,
    PRIMARY KEY (author_id,item_id),
    FOREIGN KEY (item_id) REFERENCES Item(item_id) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (author_id) REFERENCES Author(author_id) ON DELETE RESTRICT ON UPDATE CASCADE
    );

CREATE TABLE Items_of_Publisher(
    publisher_id VARCHAR (255) NOT NULL,
    item_id VARCHAR(255) NOT NULL,
    PRIMARY KEY (publisher_id,item_id),
    FOREIGN KEY (item_id) REFERENCES Item(item_id) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (publisher_id) REFERENCES Publisher(publisher_id) ON DELETE RESTRICT ON UPDATE CASCADE
    );

CREATE TABLE Items_of_Producer(
    producer_id VARCHAR (255) NOT NULL,
    item_id VARCHAR(255) NOT NULL,
    PRIMARY KEY (producer_id,item_id),
    FOREIGN KEY (item_id) REFERENCES Item(item_id) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (producer_id) REFERENCES Producer(producer_id) ON DELETE RESTRICT ON UPDATE CASCADE
    );
CREATE TABLE Items_of_Artist(
    artist_id VARCHAR (255) NOT NULL,
    item_id VARCHAR(255) NOT NULL,
    PRIMARY KEY (artist_id,item_id),
    FOREIGN KEY (item_id) REFERENCES Item(item_id) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (artist_id) REFERENCES Artist(artist_id) ON DELETE RESTRICT ON UPDATE CASCADE
    );

CREATE TABLE Event_by_Organizer(
    organizer_email VARCHAR (255) NOT NULL,
    event_name VARCHAR(255) NOT NULL,
    PRIMARY KEY (organizer_email,event_name),
    FOREIGN KEY (organizer_email) REFERENCES Organizer(organizer_email) ON DELETE CASCADE ON UPDATE CASCADE,
    FOREIGN KEY (event_name) REFERENCES Event(event_name) ON DELETE CASCADE ON UPDATE CASCADE
    );

 * sqlite:///library.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [5]:
%%sql

INSERT INTO Person 
VALUES 
('1', 'Amy','Davis','3620 Peachtree St','#302','Richmond','CA','580025','762-331-1112','amydavis0312@gmail.com', 'F', 'Staff', '2003-01-02', '2023-01-02',0),
('2', 'Murray','Boyd','1250 201th St','#123','Riverside','CA','523525','123-331-1112','murrayboyd0122@gmail.com', 'M', 'Faculty', '2003-05-02', '2022-01-02',0),
('3', 'Mysha','Downs','326 Moon Ave','#806','Orange County','CA','532400','456-331-1112','myshadowns1222@gmail.com', 'F', 'Staff', '2005-05-02', '2025-01-02',1),
('4', 'Menaal','Leech','1852 Manson Dr','#703','Surrey','WA','463230','456-567-1112','menaalleech0329@icloud.com', 'F', 'Graduate', '2007-05-02', '2021-01-26',0),
('5', 'Dalton','Kirby','6520 Arcadia Rd','#1209','Lanley','WA','436520','456-331-6682','daltonkirby0905@gmail.com', 'M', 'Undergraduate', '2012-05-02', '2023-12-02',1),
('6', 'Dorian','Lester','3526 27th Ave','#195','Riverside','CA','535625','165-331-1112','dorianlester0122@gmail.com', 'F', 'Staff', '2003-05-02', '2022-01-02',0),
('7', 'Anwar','Bourne','250 Booker St','#806','Orange County','CA','532400','456-387-1112','anwarbourne1212@gmail.com', 'M', 'Graduate', '2005-05-02', '2025-01-02',1),
('8', 'Johanna','Lee','3652 85 Ave','#703','Surrey','WA','463230','856-567-1156','johannalee0316@icloud.com', 'F', 'Faculty', '2007-05-02', '2021-01-26',0),
('9', 'Spencer','Mai','6520 Bullock Rd','#327','Lanley','WA','65493','453-351-2182','spencermai1005@gmail.com', 'M', 'Faculty', '2012-05-02', '2023-12-02',1),
('11', 'Dannielle','Pope','6520 Griff Rd','#936','Maple Ridge','WA','79941','852-361-6682','dannielle0906@gmail.com', 'F', 'Staff', '2012-05-02', '2023-12-02',1),
('12', 'Renee','Zhong','6520 Stevenson St','#306','Lanley','BC','56716','376-331-6682','reneezhong0813@gmail.com', 'F', 'Staff', '2012-05-02', '2023-12-02',1),
('13', 'Roxanne','Cantu','6520 ridge Dr','#2101','Pitt Meadow','WA','236466','256-645-6682','roxannecantu0105@gmail.com', 'M', 'Staff', '2012-05-02', '2023-12-02',1),
('14', 'Renee','Fleming','79 ','Robson St','Vancouver','BC','V6B 3K9','604-602-3324','t4k3cl094@fakeuniv.ca', 'F', 'Staff', '2012-05-02', '2022-12-02',1),
('15', 'Amparo','Sharpe','1912','1912  Keith Road','North Vancouver','BC','V5T 2C1','604-988-9491','1z8y8e5vg9fh@fakeuniv.ca', 'F', 'Staff', '2012-06-02', '2022-07-02',1),
('16', 'Rebecca','Foy','3084 ','Carter Crescent','North River','NS','B2N 5B5','902-986-0286','gogs7yhhmja@fakeuniv.ca', 'F', 'Staff', '2017-05-02', '2024-12-02',1),
('17', 'Ronald','Diaz','4878','Main St','Bjorkdale','SK','S0E 0E0','306-886-4497','6vivvo3jyu3@fakeuniv.ca', 'M', 'Staff', '2014-05-02', '2025-12-01',1),
('18', 'Thomas','Moore','944','944  Sturgeon Drive','Peace River','AB','T8S 1V9','780-596-4631','7f11zii1r3@fakeuniv.ca', 'M', 'Staff', '2014-05-02', '2025-12-01',1);

 * sqlite:///library.db
17 rows affected.

[]

In [6]:
%%sql 

SELECT * FROM Person;

 * sqlite:///library.db
Done.

[('1', 'Amy', 'Davis', '3620 Peachtree St', '#302', 'Richmond', 'CA', '580025', '762-331-1112', 'amydavis0312@gmail.com', 'F', 'Staff', '2003-01-02', '2023-01-02', 0),
 ('2', 'Murray', 'Boyd', '1250 201th St', '#123', 'Riverside', 'CA', '523525', '123-331-1112', 'murrayboyd0122@gmail.com', 'M', 'Faculty', '2003-05-02', '2022-01-02', 0),
 ('3', 'Mysha', 'Downs', '326 Moon Ave', '#806', 'Orange County', 'CA', '532400', '456-331-1112', 'myshadowns1222@gmail.com', 'F', 'Staff', '2005-05-02', '2025-01-02', 1),
 ('4', 'Menaal', 'Leech', '1852 Manson Dr', '#703', 'Surrey', 'WA', '463230', '456-567-1112', 'menaalleech0329@icloud.com', 'F', 'Graduate', '2007-05-02', '2021-01-26', 0),
 ('5', 'Dalton', 'Kirby', '6520 Arcadia Rd', '#1209', 'Lanley', 'WA', '436520', '456-331-6682', 'daltonkirby0905@gmail.com', 'M', 'Undergraduate', '2012-05-02', '2023-12-02', 1),
 ('6', 'Dorian', 'Lester', '3526 27th Ave', '#195', 'Riverside', 'CA', '535625', '165-331-1112', 'dorianlester0122@gmail.com', 'F', 'Staff', '2003-05-02', '2022-01-02', 0),
 ('7', 'Anwar', 'Bourne', '250 Booker St', '#806', 'Orange County', 'CA', '532400', '456-387-1112', 'anwarbourne1212@gmail.com', 'M', 'Graduate', '2005-05-02', '2025-01-02', 1),
 ('8', 'Johanna', 'Lee', '3652 85 Ave', '#703', 'Surrey', 'WA', '463230', '856-567-1156', 'johannalee0316@icloud.com', 'F', 'Faculty', '2007-05-02', '2021-01-26', 0),
 ('9', 'Spencer', 'Mai', '6520 Bullock Rd', '#327', 'Lanley', 'WA', '65493', '453-351-2182', 'spencermai1005@gmail.com', 'M', 'Faculty', '2012-05-02', '2023-12-02', 1),
 ('11', 'Dannielle', 'Pope', '6520 Griff Rd', '#936', 'Maple Ridge', 'WA', '79941', '852-361-6682', 'dannielle0906@gmail.com', 'F', 'Staff', '2012-05-02', '2023-12-02', 1),
 ('12', 'Renee', 'Zhong', '6520 Stevenson St', '#306', 'Lanley', 'BC', '56716', '376-331-6682', 'reneezhong0813@gmail.com', 'F', 'Staff', '2012-05-02', '2023-12-02', 1),
 ('13', 'Roxanne', 'Cantu', '6520 ridge Dr', '#2101', 'Pitt Meadow', 'WA', '236466', '256-645-6682', 'roxannecantu0105@gmail.com', 'M', 'Staff', '2012-05-02', '2023-12-02', 1),
 ('14', 'Renee', 'Fleming', '79 ', 'Robson St', 'Vancouver', 'BC', 'V6B 3K9', '604-602-3324', 't4k3cl094@fakeuniv.ca', 'F', 'Staff', '2012-05-02', '2022-12-02', 1),
 ('15', 'Amparo', 'Sharpe', '1912', '1912  Keith Road', 'North Vancouver', 'BC', 'V5T 2C1', '604-988-9491', '1z8y8e5vg9fh@fakeuniv.ca', 'F', 'Staff', '2012-06-02', '2022-07-02', 1),
 ('16', 'Rebecca', 'Foy', '3084 ', 'Carter Crescent', 'North River', 'NS', 'B2N 5B5', '902-986-0286', 'gogs7yhhmja@fakeuniv.ca', 'F', 'Staff', '2017-05-02', '2024-12-02', 1),
 ('17', 'Ronald', 'Diaz', '4878', 'Main St', 'Bjorkdale', 'SK', 'S0E 0E0', '306-886-4497', '6vivvo3jyu3@fakeuniv.ca', 'M', 'Staff', '2014-05-02', '2025-12-01', 1),
 ('18', 'Thomas', 'Moore', '944', '944  Sturgeon Drive', 'Peace River', 'AB', 'T8S 1V9', '780-596-4631', '7f11zii1r3@fakeuniv.ca', 'M', 'Staff', '2014-05-02', '2025-12-01', 1)]

In [7]:
%%sql

INSERT INTO  Personnel
VALUES('2009-05-02','2029-05-02','1'),
('2003-01-12', '2023-01-12','11'),
('2004-07-24', '2014-07-24','3'),
('2005-03-28', '2020-03-28','6'),
('2007-06-16', '2017-06-16','12'),
('2006-05-13', '2022-05-13','13'),
('2013-01-04', '2023-01-04','14'),
('2009-12-09', '2019-12-09','15'),
('2010-09-07', '2021-09-07','16'),
('2011-11-24', '2021-11-24','17');

 * sqlite:///library.db
10 rows affected.

[]

In [8]:
%%sql 

SELECT * FROM Personnel;

 * sqlite:///library.db
Done.

[('2009-05-02', '2029-05-02', '1'),
 ('2003-01-12', '2023-01-12', '11'),
 ('2004-07-24', '2014-07-24', '3'),
 ('2005-03-28', '2020-03-28', '6'),
 ('2007-06-16', '2017-06-16', '12'),
 ('2006-05-13', '2022-05-13', '13'),
 ('2013-01-04', '2023-01-04', '14'),
 ('2009-12-09', '2019-12-09', '15'),
 ('2010-09-07', '2021-09-07', '16'),
 ('2011-11-24', '2021-11-24', '17')]

In [9]:
%%sql
INSERT INTO Item
VALUES
('B1', 'Introduction to Algorithm','Books-non fiction', '2009-05-02', 1, 'NF1', '2020-02-01', '2020-04-02', '2020-03-28', '5'),
('B2', 'Frankenstein','Books-fiction', '2012-09-12', 1, 'F1', '2020-02-01', '2020-05-02', NULL,'1'),
('B3', 'Nevermind', 'Books-fiction','1991-09-04', 1, 'F3', '2020-01-01', '2020-03-02', '2020-03-01',  '4'),
('B4', 'Big Little Lies','Books-fiction', '2014-07-09', 1, 'F3', '2020-04-01', '2020-06-02', NULL, '3'),
('B5', 'Database Design','Books-non fiction',  '2009-05-02', 1, 'NF1', '2020-02-01', '2020-04-02', '2020-03-28','7'),
('B6', 'An Adventure City 1', 'Books-fiction','2012-09-12', 0, 'F5', '2020-03-01', '2020-05-02', NULL, '11'),
('B7', 'The Amazing World of Science Part-1', 'Books-non fiction', '1991-09-04', 1, 'NF1', '2020-01-01', '2020-03-02', '2020-03-01',  '8'),
('B8', 'The Great Gatsby', 'Books-fiction','2014-07-09', 1, 'F7', '2020-04-01', '2020-06-02', NULL,  '9'),
('B9', 'An Adventure City 2','Books-fiction', '2009-05-02', 1, 'F1', '2020-02-01', '2020-04-02', '2020-03-28', '11'),
('B11', 'An Adventure City 3', 'Books-fiction','2012-09-12', 0, 'F4', '2020-03-01', '2020-05-02', NULL,  '12'),
('P1', 'Fashion Focus', 'Magazine','2017-09-12', 1, 'PM4', '2019-03-01', '2019-05-02', '2019-05-02',  '11'),
('P2', 'City Scoop', 'Magazine','2020-01-05', 1, 'PM2', '2020-03-01', '2020-05-01', NULL,  '7'),
('P3', 'Vogue', 'Magazine','2019-09-12', 1, 'PM4', '2020-03-02', '2020-03-02', NULL,  '2'),
('P4', 'Soul Talk', 'Magazine','2019-09-11', 0, 'PM6', '2020-01-01', '2020-03-01', '2020-03-01',  '1'),
('P5', 'Disculture', 'Magazine','2015-09-11', 1, 'PM4', '2019-03-01', '2019-05-01', '2019-05-01',  '11'),
('P6', 'Journal of Applied Physics', 'Journal','2009-09-12', 0, 'PJ1', '2010-03-01', '2010-06-01', '2010-06-01',  '18'),
('P7', 'Journal of Electrical Engineering', 'Journal','2008-09-12', 1, 'PJ4', '2011-03-01', '2011-05-01', '2011-05-01',  '15'),
('P8', 'Nature', 'Journal','2019-08-12', 0, 'PJ7', '2020-03-01', '2020-05-01', NULL,  '13'),
('P9', 'Journal of water management', 'Journal','2012-05-12', 1, 'PJ2', '2018-03-01', '2018-05-01', '2018-05-01',  '6'),
('P11', 'Journal of Mathematics', 'Journal','2013-01-12', 1, 'PJ4', '2015-03-01', '2015-05-01', '2015-05-01',  '5'),
('A1', 'Tongue and cheeks', 'Movie','2017-09-12', 1, 'M4', '2019-03-01', '2019-05-02', '2019-05-02',  '11'),
('A2', 'Beasts of beauty', 'Movie','2020-01-05', 1, 'M2', '2020-03-01', '2020-05-01', NULL,  '7'),
('A3', 'Bankrupcy', 'Movie','2019-09-12', 1, 'M4', '2020-03-02', '2020-03-02', NULL,  '2'),
('A4', 'Death dead', 'Movie','2019-09-11', 0, 'M6', '2020-01-01', '2020-03-01', '2020-03-01',  '1'),
('A5', 'Cloud nine', 'Movie','2015-09-11', 1, 'M4', '2019-03-01', '2019-05-01', '2019-05-01',  '11'),
('A6', 'Bold fortune', 'Music','2009-09-12', 0, 'MU1', '2010-03-01', '2010-06-01', '2010-06-01',  '18'),
('A7', 'So far so great', 'Music','2008-09-12', 1, 'MU4', '2011-03-01', '2011-05-01', '2011-05-01',  '15'),
('A8', 'Honesty', 'Music','2019-08-12', 0, 'MU7', '2020-03-01', '2020-05-01', NULL,  '13'),
('A9', 'Battleborn', 'Music','2012-05-12', 1, 'MU2', '2018-03-01', '2018-05-01', '2018-05-01',  '6'),
('A11', 'Parliment of fools', 'Music','2013-01-12', 1, 'MU4', '2015-03-01', '2015-05-01', '2015-05-01','5');

 * sqlite:///library.db
30 rows affected.

[]

In [10]:
%%sql 

SELECT * FROM Item;

 * sqlite:///library.db
Done.

[('B1', 'Introduction to Algorithm', 'Books-non fiction', '2009-05-02', 1, 'NF1', '2020-02-01', '2020-04-02', '2020-03-28', '5'),
 ('B2', 'Frankenstein', 'Books-fiction', '2012-09-12', 1, 'F1', '2020-02-01', '2020-05-02', None, '1'),
 ('B3', 'Nevermind', 'Books-fiction', '1991-09-04', 1, 'F3', '2020-01-01', '2020-03-02', '2020-03-01', '4'),
 ('B4', 'Big Little Lies', 'Books-fiction', '2014-07-09', 1, 'F3', '2020-04-01', '2020-06-02', None, '3'),
 ('B5', 'Database Design', 'Books-non fiction', '2009-05-02', 1, 'NF1', '2020-02-01', '2020-04-02', '2020-03-28', '7'),
 ('B6', 'An Adventure City 1', 'Books-fiction', '2012-09-12', 0, 'F5', '2020-03-01', '2020-05-02', None, '11'),
 ('B7', 'The Amazing World of Science Part-1', 'Books-non fiction', '1991-09-04', 1, 'NF1', '2020-01-01', '2020-03-02', '2020-03-01', '8'),
 ('B8', 'The Great Gatsby', 'Books-fiction', '2014-07-09', 1, 'F7', '2020-04-01', '2020-06-02', None, '9'),
 ('B9', 'An Adventure City 2', 'Books-fiction', '2009-05-02', 1, 'F1', '2020-02-01', '2020-04-02', '2020-03-28', '11'),
 ('B11', 'An Adventure City 3', 'Books-fiction', '2012-09-12', 0, 'F4', '2020-03-01', '2020-05-02', None, '12'),
 ('P1', 'Fashion Focus', 'Magazine', '2017-09-12', 1, 'PM4', '2019-03-01', '2019-05-02', '2019-05-02', '11'),
 ('P2', 'City Scoop', 'Magazine', '2020-01-05', 1, 'PM2', '2020-03-01', '2020-05-01', None, '7'),
 ('P3', 'Vogue', 'Magazine', '2019-09-12', 1, 'PM4', '2020-03-02', '2020-03-02', None, '2'),
 ('P4', 'Soul Talk', 'Magazine', '2019-09-11', 0, 'PM6', '2020-01-01', '2020-03-01', '2020-03-01', '1'),
 ('P5', 'Disculture', 'Magazine', '2015-09-11', 1, 'PM4', '2019-03-01', '2019-05-01', '2019-05-01', '11'),
 ('P6', 'Journal of Applied Physics', 'Journal', '2009-09-12', 0, 'PJ1', '2010-03-01', '2010-06-01', '2010-06-01', '18'),
 ('P7', 'Journal of Electrical Engineering', 'Journal', '2008-09-12', 1, 'PJ4', '2011-03-01', '2011-05-01', '2011-05-01', '15'),
 ('P8', 'Nature', 'Journal', '2019-08-12', 0, 'PJ7', '2020-03-01', '2020-05-01', None, '13'),
 ('P9', 'Journal of water management', 'Journal', '2012-05-12', 1, 'PJ2', '2018-03-01', '2018-05-01', '2018-05-01', '6'),
 ('P11', 'Journal of Mathematics', 'Journal', '2013-01-12', 1, 'PJ4', '2015-03-01', '2015-05-01', '2015-05-01', '5'),
 ('A1', 'Tongue and cheeks', 'Movie', '2017-09-12', 1, 'M4', '2019-03-01', '2019-05-02', '2019-05-02', '11'),
 ('A2', 'Beasts of beauty', 'Movie', '2020-01-05', 1, 'M2', '2020-03-01', '2020-05-01', None, '7'),
 ('A3', 'Bankrupcy', 'Movie', '2019-09-12', 1, 'M4', '2020-03-02', '2020-03-02', None, '2'),
 ('A4', 'Death dead', 'Movie', '2019-09-11', 0, 'M6', '2020-01-01', '2020-03-01', '2020-03-01', '1'),
 ('A5', 'Cloud nine', 'Movie', '2015-09-11', 1, 'M4', '2019-03-01', '2019-05-01', '2019-05-01', '11'),
 ('A6', 'Bold fortune', 'Music', '2009-09-12', 0, 'MU1', '2010-03-01', '2010-06-01', '2010-06-01', '18'),
 ('A7', 'So far so great', 'Music', '2008-09-12', 1, 'MU4', '2011-03-01', '2011-05-01', '2011-05-01', '15'),
 ('A8', 'Honesty', 'Music', '2019-08-12', 0, 'MU7', '2020-03-01', '2020-05-01', None, '13'),
 ('A9', 'Battleborn', 'Music', '2012-05-12', 1, 'MU2', '2018-03-01', '2018-05-01', '2018-05-01', '6'),
 ('A11', 'Parliment of fools', 'Music', '2013-01-12', 1, 'MU4', '2015-03-01', '2015-05-01', '2015-05-01', '5')]

In [11]:
%%sql
INSERT INTO Books
VALUES('1st edition', 'B1', 1), 
('1831 edition', 'B2', 0), 
('2nd edition', 'B3', 0),
('1st edition', 'B4', 1), 
('3rd edition', 'B5', 0), 
('2nd edition', 'B6', 0),
('1st edition', 'B7', 1), 
('2nd edition', 'B8', 0), 
('2nd edition', 'B9', 0),
('1st edition', 'B11', 1);

 * sqlite:///library.db
10 rows affected.

[]

In [12]:
%%sql 

SELECT * FROM Books;

 * sqlite:///library.db
Done.

[('1st edition', 'B1', 1),
 ('1831 edition', 'B2', 0),
 ('2nd edition', 'B3', 0),
 ('1st edition', 'B4', 1),
 ('3rd edition', 'B5', 0),
 ('2nd edition', 'B6', 0),
 ('1st edition', 'B7', 1),
 ('2nd edition', 'B8', 0),
 ('2nd edition', 'B9', 0),
 ('1st edition', 'B11', 1)]

In [13]:
%%sql
INSERT INTO Periodicals
VALUES('III', '3','P1',1),
('V', '21','P2',0),
('11', '43','P3',0),
('30', '3','P4',0),
('5', '5','P5',1),
('8', '56','P6',1),
('13', '84','P7',0),
('17', '5','P8',1),
('19', '3','P9',1),
('II', '2','P11',0);

 * sqlite:///library.db
10 rows affected.

[]

In [14]:
%%sql 

SELECT * FROM Periodicals;

 * sqlite:///library.db
Done.

[('III', 3, 'P1', 1),
 ('V', 21, 'P2', 0),
 ('11', 43, 'P3', 0),
 ('30', 3, 'P4', 0),
 ('5', 5, 'P5', 1),
 ('8', 56, 'P6', 1),
 ('13', 84, 'P7', 0),
 ('17', 5, 'P8', 1),
 ('19', 3, 'P9', 1),
 ('II', 2, 'P11', 0)]

In [15]:
%%sql
INSERT INTO Audiovisuals 
VALUES ('CD', 'A1'),
('DVD', 'A2'),
('CD', 'A3'),
('DVD', 'A4'),
('CDl', 'A5'),
('DVD', 'A6'),
('CD', 'A7'),
('record', 'A8'),
('CD', 'A9'),
('casette', 'A11');

 * sqlite:///library.db
10 rows affected.

[]

In [16]:
%%sql 

SELECT * FROM Audiovisuals ;

 * sqlite:///library.db
Done.

[('CD', 'A1'),
 ('DVD', 'A2'),
 ('CD', 'A3'),
 ('DVD', 'A4'),
 ('CDl', 'A5'),
 ('DVD', 'A6'),
 ('CD', 'A7'),
 ('record', 'A8'),
 ('CD', 'A9'),
 ('casette', 'A11')]

In [17]:
%%sql
INSERT INTO Artist 
VALUES('ART1', 'Tony Scott'),
('ART2', 'Ross Everett'),
('ART3', 'Nicolas Chandler'),
('ART4', 'Billy Sierra'),
('ART5', 'Lauren Strong'),
('ART6', 'Nirvana'),
('ART7', 'Leah Page'),
('ART8', 'Jude Carter'),
('ART9', 'Nirvana'),
('ART11', 'Aiden Diamond');

 * sqlite:///library.db
10 rows affected.

[]

In [18]:
%%sql 

SELECT * FROM Artist ;

 * sqlite:///library.db
Done.

[('ART1', 'Tony Scott'),
 ('ART2', 'Ross Everett'),
 ('ART3', 'Nicolas Chandler'),
 ('ART4', 'Billy Sierra'),
 ('ART5', 'Lauren Strong'),
 ('ART6', 'Nirvana'),
 ('ART7', 'Leah Page'),
 ('ART8', 'Jude Carter'),
 ('ART9', 'Nirvana'),
 ('ART11', 'Aiden Diamond')]

In [19]:
%%sql

INSERT INTO Author 
VALUES('AU1', 'Thomas', 'Cormen'),
('AU2', 'Jess', 'Waters'),
('AU3', 'Brett', 'Marshall'),
('AU4', 'Marlene', 'Bishop'),
('AU5', 'Ellen', 'Holmes'),
('AU6', 'Chelsea', 'Banks'),
('AU7', 'Morris ', 'Harris'),
('AU8', 'Ash ', 'Barron'),
('AU9', 'Cristian', 'Brooks'),
('AU10', 'Andrews', 'Graves');

 * sqlite:///library.db
10 rows affected.

[]

In [20]:
%%sql 

SELECT * FROM Author ;

 * sqlite:///library.db
Done.

[('AU1', 'Thomas', 'Cormen'),
 ('AU2', 'Jess', 'Waters'),
 ('AU3', 'Brett', 'Marshall'),
 ('AU4', 'Marlene', 'Bishop'),
 ('AU5', 'Ellen', 'Holmes'),
 ('AU6', 'Chelsea', 'Banks'),
 ('AU7', 'Morris ', 'Harris'),
 ('AU8', 'Ash ', 'Barron'),
 ('AU9', 'Cristian', 'Brooks'),
 ('AU10', 'Andrews', 'Graves')]

In [21]:
%%sql

INSERT INTO Publisher
VALUES('PU1', 'Golfweek Turnstile Publishing'),
('PU2', 'Mariner Software Inc'),
('PU3', 'Hitchcock Broadcasting'),
('PU4', 'Atwood Publishing'),
('PU5', 'Vicki Cato'),
('PU6', 'Elsevier'),
('PU7', 'Thomson Reuters'),
('PU8', 'Xos Technologies Inc'),
('PU9', 'Texas Outdoors Journal Inc'),
('PU11', 'Naecr');

 * sqlite:///library.db
10 rows affected.

[]

In [22]:
%%sql 

SELECT * FROM Publisher;

 * sqlite:///library.db
Done.

[('PU1', 'Golfweek Turnstile Publishing'),
 ('PU2', 'Mariner Software Inc'),
 ('PU3', 'Hitchcock Broadcasting'),
 ('PU4', 'Atwood Publishing'),
 ('PU5', 'Vicki Cato'),
 ('PU6', 'Elsevier'),
 ('PU7', 'Thomson Reuters'),
 ('PU8', 'Xos Technologies Inc'),
 ('PU9', 'Texas Outdoors Journal Inc'),
 ('PU11', 'Naecr')]

In [23]:
%%sql

INSERT INTO Producer
VALUES('PRO1', 'Glen Khan'),
('PRO2', 'Tom Moon'),
('PRO3', 'Oliver Page Productions'),
('PRO4', 'David Gordon'),
('PRO5', 'Maddox Strange'),
('PRO6', 'Denny Sterling'),
('PRO7', 'Brook Christy'),
('PRO8', 'Elizabeth Nelson'),
('PRO9', 'Erika Strong'),
('PRO11', 'Ella Rich');

 * sqlite:///library.db
10 rows affected.

[]

In [24]:
%%sql 

SELECT * FROM Producer;

 * sqlite:///library.db
Done.

[('PRO1', 'Glen Khan'),
 ('PRO2', 'Tom Moon'),
 ('PRO3', 'Oliver Page Productions'),
 ('PRO4', 'David Gordon'),
 ('PRO5', 'Maddox Strange'),
 ('PRO6', 'Denny Sterling'),
 ('PRO7', 'Brook Christy'),
 ('PRO8', 'Elizabeth Nelson'),
 ('PRO9', 'Erika Strong'),
 ('PRO11', 'Ella Rich')]

In [25]:
%%sql
INSERT INTO Volunteer_options 
VALUES('Read with immigrants-Basic', 'Adult literacy tutoring','meet weekly with a group of immigrants and teach them to read in english. ',15),
('Read with immigrants-Intermediate', 'Adult literacy tutoring','meet weekly with a group of immigrants and teach them to read in english',15),
('Read with immigrants-Advanced', 'Adult literacy tutoring','meet weekly with a group of immigrants and teach them to read in english',15),
('Fun with numbers-Basic', 'Adult numeracy tutoring','meet weekly with adults and teach them to arithmetic skills',10),
('Fun with numbers-Intermediate', 'Adult numeracy tutoring','meet weekly with adults and teach them to arithmetic skills',10),
('Fun with numbers-Advanced', 'Adult numeracy tutoring','meet weekly with adults and teach them to arithmetic skills',10),
('Books for Seniors', 'Home deliver library materials','deliver books for seniors at their required destinations',5),
('Books for Young', 'Home deliver library materials','deliver books for kids at their homes',10),
('Youth Ambassador', 'Teen volunteers','Read a book every 2 weeks, write a review on it and share with peers',10),
('Gardening', 'Others','Tend to the greenery around the library, performing tasks assigned by head gardener',5);

 * sqlite:///library.db
10 rows affected.

[]

In [26]:
%%sql 

SELECT * FROM Volunteer_options;

 * sqlite:///library.db
Done.

[('Read with immigrants-Basic', 'Adult literacy tutoring', 'meet weekly with a group of immigrants and teach them to read in english. ', 15),
 ('Read with immigrants-Intermediate', 'Adult literacy tutoring', 'meet weekly with a group of immigrants and teach them to read in english', 15),
 ('Read with immigrants-Advanced', 'Adult literacy tutoring', 'meet weekly with a group of immigrants and teach them to read in english', 15),
 ('Fun with numbers-Basic', 'Adult numeracy tutoring', 'meet weekly with adults and teach them to arithmetic skills', 10),
 ('Fun with numbers-Intermediate', 'Adult numeracy tutoring', 'meet weekly with adults and teach them to arithmetic skills', 10),
 ('Fun with numbers-Advanced', 'Adult numeracy tutoring', 'meet weekly with adults and teach them to arithmetic skills', 10),
 ('Books for Seniors', 'Home deliver library materials', 'deliver books for seniors at their required destinations', 5),
 ('Books for Young', 'Home deliver library materials', 'deliver books for kids at their homes', 10),
 ('Youth Ambassador', 'Teen volunteers', 'Read a book every 2 weeks, write a review on it and share with peers', 10),
 ('Gardening', 'Others', 'Tend to the greenery around the library, performing tasks assigned by head gardener', 5)]

In [27]:
%%sql

INSERT INTO Volunteer 
VALUES('Read with immigrants-Basic', '1'),
('Fun with numbers-Advanced', '2'),
('Fun with numbers-Basic', '3'),
('Read with immigrants-Intermediate', '7'),
('Youth Ambassador', '5'),
('Books for Young', '2'),
('Fun with numbers-Intermediate', '1'),
('Books for Seniors', '4'),
('Read with immigrants-Basic', '9'),
('Gardening', '8');

 * sqlite:///library.db
10 rows affected.

[]

In [28]:
%%sql 

SELECT * FROM Volunteer ;

 * sqlite:///library.db
Done.

[('Read with immigrants-Basic', '1'),
 ('Fun with numbers-Advanced', '2'),
 ('Fun with numbers-Basic', '3'),
 ('Read with immigrants-Intermediate', '7'),
 ('Youth Ambassador', '5'),
 ('Books for Young', '2'),
 ('Fun with numbers-Intermediate', '1'),
 ('Books for Seniors', '4'),
 ('Read with immigrants-Basic', '9'),
 ('Gardening', '8')]

In [29]:
%%sql

INSERT INTO Help
VALUES (1,'Research/finding items','Help with finding articles for course SF233',1,'1'),
(2,'Citation help','Help with checking citation on final paper',1,'2'),
(3,'Research/finding items','Help with finding articles on gardening',0,'3'),
(4,'Research/finding items','Help with finding articles on Rosa Parks',0,'4'),
(5,'Research/finding items','Help with finding articles on JK Rowling',0,'15'),
(6,'Writing help','Proofreading help on term paper',1,'4'),
(7,'Research/finding items','Help with finding books to read in summer',0,'5'),
(8,'Writing help','Brainstorm essay outline for course',1,'3'),
(9,'Research/finding items','Help with finding books on machine learning',0,'11'),
(10,'Research/finding items','Help with finding journals for BUS 322',1,'6');

 * sqlite:///library.db
10 rows affected.

[]

In [30]:
%%sql 

SELECT * FROM Help ;

 * sqlite:///library.db
Done.

[(1, 'Research/finding items', 'Help with finding articles for course SF233', 1, '1'),
 (2, 'Citation help', 'Help with checking citation on final paper', 1, '2'),
 (3, 'Research/finding items', 'Help with finding articles on gardening', 0, '3'),
 (4, 'Research/finding items', 'Help with finding articles on Rosa Parks', 0, '4'),
 (5, 'Research/finding items', 'Help with finding articles on JK Rowling', 0, '15'),
 (6, 'Writing help', 'Proofreading help on term paper', 1, '4'),
 (7, 'Research/finding items', 'Help with finding books to read in summer', 0, '5'),
 (8, 'Writing help', 'Brainstorm essay outline for course', 1, '3'),
 (9, 'Research/finding items', 'Help with finding books on machine learning', 0, '11'),
 (10, 'Research/finding items', 'Help with finding journals for BUS 322', 1, '6')]

In [31]:
%%sql

INSERT INTO Location 
VALUES(1,'R11'),
(1,'R12'),
(1,'R13'),
(1,'R14'),
(1,'R15'),
(2,'R21'),
(2,'R22'),
(2,'R23'),
(2,'R24'),
(2,'R25');

 * sqlite:///library.db
10 rows affected.

[]

In [32]:
%%sql 

SELECT * FROM Location  ;

 * sqlite:///library.db
Done.

[(1, 'R11'),
 (1, 'R12'),
 (1, 'R13'),
 (1, 'R14'),
 (1, 'R15'),
 (2, 'R21'),
 (2, 'R22'),
 (2, 'R23'),
 (2, 'R24'),
 (2, 'R25')]

In [33]:
%%sql

INSERT INTO Event
VALUES ('Book review of Amazing Amy', 'Book related events','Express and hear opinions on the book', '2020-06-01','05:00 PM','Everyone',1,'R11'),
('Book review of Happy Housecat', 'Book related events','Express and hear opinions on the book', '2020-05-02','04:00 PM','Everyone',1,'R21'),
('Book review of An Adventure City 3', 'Book related events','Express and hear opinions on the book', '2020-08-03','05:00 PM','Everyone',1,'R13'),
('Gone with the wind', 'Film screenings','Watch the old classic movie with your family', '2020-11-04','03:00 PM','Everyone',0,'R11'),
('Home Alone 1', 'Film screenings','Bring your kids to this family friendly movie', '2020-06-05','02:00 PM','Everyone',0,'R24'),
('Hexagonals', 'Art shows','Mathematics in everyday life', '2020-07-06','09:00 PM','Everyone',0,'R23'),
('Man and Machine', 'Art shows','Modern art show by upcoming artists', '2020-09-07','09:00 AM','Everyone',0,'R11'),
('Writing Essays', 'Workshops','Will cover all ascepts of writing effective term papers', '2020-11-08','10:00 AM','Students',1,'R12'),
('Meet and Greet with Library Personnel', 'Others','Get to know your library personnel', '2020-09-09','04:00 PM','Everyone',1,'R13'),
('Community meet', ' Networking','Meet others, make friends', '2020-07-01','05:00 PM','Everyone',1,'R21');

 * sqlite:///library.db
10 rows affected.

[]

In [34]:
%%sql 

SELECT * FROM Event ;

 * sqlite:///library.db
Done.

[('Book review of Amazing Amy', 'Book related events', 'Express and hear opinions on the book', '2020-06-01', '05:00 PM', 'Everyone', 1, 'R11'),
 ('Book review of Happy Housecat', 'Book related events', 'Express and hear opinions on the book', '2020-05-02', '04:00 PM', 'Everyone', 1, 'R21'),
 ('Book review of An Adventure City 3', 'Book related events', 'Express and hear opinions on the book', '2020-08-03', '05:00 PM', 'Everyone', 1, 'R13'),
 ('Gone with the wind', 'Film screenings', 'Watch the old classic movie with your family', '2020-11-04', '03:00 PM', 'Everyone', 0, 'R11'),
 ('Home Alone 1', 'Film screenings', 'Bring your kids to this family friendly movie', '2020-06-05', '02:00 PM', 'Everyone', 0, 'R24'),
 ('Hexagonals', 'Art shows', 'Mathematics in everyday life', '2020-07-06', '09:00 PM', 'Everyone', 0, 'R23'),
 ('Man and Machine', 'Art shows', 'Modern art show by upcoming artists', '2020-09-07', '09:00 AM', 'Everyone', 0, 'R11'),
 ('Writing Essays', 'Workshops', 'Will cover all ascepts of writing effective term papers', '2020-11-08', '10:00 AM', 'Students', 1, 'R12'),
 ('Meet and Greet with Library Personnel', 'Others', 'Get to know your library personnel', '2020-09-09', '04:00 PM', 'Everyone', 1, 'R13'),
 ('Community meet', ' Networking', 'Meet others, make friends', '2020-07-01', '05:00 PM', 'Everyone', 1, 'R21')]

In [35]:
%%sql

INSERT INTO New_items
VALUES (1,'Traitors With Money', 'Books-non fiction','1','Contemporary book on the biggest swindlers who got away with it', 'Excellent'),
(2,'Swords Of The World', 'Books-non fiction','3','Book on different swords in the world', 'Fair'),
(3,'Neighbor With Curly Hair', 'Books-fiction','4','book for kids-has pictures','Good'),
(4,'Signs Of The Lakes', 'Books-non fiction','4','Romance Novel by Joseph Jackson', 'Excellent'),
(5,'Enemies Without Limits', 'Books-fiction','5','Mystery Novel by Clare Winters', 'Poor'),
(6,'Pure The World', 'Books-fiction','16','Novel by Tim Rogers', 'Excellent'),
(7,'Rodents And Ancients', 'Books-non fiction','13','History of Rodents', 'Good'),
(8,'Mystery Of The Galaxy', 'Books-non fiction','7','Book on Cosmos', 'Fair'),
(9,'Advancement Of The Caves', 'Books-non fiction','9','History of caves around the world', 'Poor'),
(10,'Flowers In Your Garden', 'Books-non fiction','5','Book on different flowers', 'Excellent');

 * sqlite:///library.db
10 rows affected.

[]

In [36]:
%%sql 

SELECT * FROM New_items ;

 * sqlite:///library.db
Done.

[(1, 'Traitors With Money', 'Books-non fiction', '1', 'Contemporary book on the biggest swindlers who got away with it', 'Excellent'),
 (2, 'Swords Of The World', 'Books-non fiction', '3', 'Book on different swords in the world', 'Fair'),
 (3, 'Neighbor With Curly Hair', 'Books-fiction', '4', 'book for kids-has pictures', 'Good'),
 (4, 'Signs Of The Lakes', 'Books-non fiction', '4', 'Romance Novel by Joseph Jackson', 'Excellent'),
 (5, 'Enemies Without Limits', 'Books-fiction', '5', 'Mystery Novel by Clare Winters', 'Poor'),
 (6, 'Pure The World', 'Books-fiction', '16', 'Novel by Tim Rogers', 'Excellent'),
 (7, 'Rodents And Ancients', 'Books-non fiction', '13', 'History of Rodents', 'Good'),
 (8, 'Mystery Of The Galaxy', 'Books-non fiction', '7', 'Book on Cosmos', 'Fair'),
 (9, 'Advancement Of The Caves', 'Books-non fiction', '9', 'History of caves around the world', 'Poor'),
 (10, 'Flowers In Your Garden', 'Books-non fiction', '5', 'Book on different flowers', 'Excellent')]

In [37]:
%%sql
INSERT INTO Organizer
VALUES('Elize Barrymore','daveed@me.com'),
('Leigh Shepherd','bwcarty@yahoo.ca'),
('Ashley Walker','lstaf@mac.com'),
('Ricky Blake','ournews@yahoo.ca'),
('Edgar Bones','dbindel@verizon.net'),
('Jamie Gates','hllam@optonline.net'),
('David Marsh','rsteiner@optonline.net'),
('Maria Rider','mgreen@sbcglobal.net'),
('Alexis Thomas','hoangle@gmail.com'),
('Lily Reign','psichel@me.com');

 * sqlite:///library.db
10 rows affected.

[]

In [38]:
%%sql 

SELECT * FROM Organizer ;

 * sqlite:///library.db
Done.

[('Elize Barrymore', 'daveed@me.com'),
 ('Leigh Shepherd', 'bwcarty@yahoo.ca'),
 ('Ashley Walker', 'lstaf@mac.com'),
 ('Ricky Blake', 'ournews@yahoo.ca'),
 ('Edgar Bones', 'dbindel@verizon.net'),
 ('Jamie Gates', 'hllam@optonline.net'),
 ('David Marsh', 'rsteiner@optonline.net'),
 ('Maria Rider', 'mgreen@sbcglobal.net'),
 ('Alexis Thomas', 'hoangle@gmail.com'),
 ('Lily Reign', 'psichel@me.com')]

In [39]:
%%sql
INSERT INTO Register
VALUES  ('Book review of Amazing Amy', '1'),
('Book review of Happy Housecat', '2'),
('Book review of An Adventure City 3', '3'),
('Gone with the wind', '12'),
('Home Alone 1', '11'),
('Hexagonals', '13'),
('Man and Machine', '5'),
('Writing Essays', '7'),
('Meet and Greet with Library Personnel','5'),
('Community meet', '6');

 * sqlite:///library.db
10 rows affected.

[]

In [40]:
%%sql 

SELECT * FROM Register ;

 * sqlite:///library.db
Done.

[('Book review of Amazing Amy', '1'),
 ('Book review of Happy Housecat', '2'),
 ('Book review of An Adventure City 3', '3'),
 ('Gone with the wind', '12'),
 ('Home Alone 1', '11'),
 ('Hexagonals', '13'),
 ('Man and Machine', '5'),
 ('Writing Essays', '7'),
 ('Meet and Greet with Library Personnel', '5'),
 ('Community meet', '6')]

In [41]:
%%sql
INSERT INTO Fines_on
VALUES ('B1','3','2018-01-02','2.0','2.0'),
('A1','2','2019-12-02','4.0','15.0'),
('B3','1','2017-06-02','2.0','2.0'),
('P2','13','2018-04-02','10.0','10.0'),
('A1','6','2019-11-02','4.0','0.0'),
('B1','7','2018-03-02','6.0','6.0'),
('A7','3','2020-01-02','8.0','0.0'),
('B1','8','2019-03-02','2.0','2.0'),
('B6','4','2017-05-02','5.0','5.0'),
('P7','9','2020-02-11','2.0','0.0');

 * sqlite:///library.db
10 rows affected.

[]

In [42]:
%%sql 

SELECT * FROM Fines_on ;

 * sqlite:///library.db
Done.

[('B1', '3', '2018-01-02', 2.0, 2.0),
 ('A1', '2', '2019-12-02', 4.0, 15.0),
 ('B3', '1', '2017-06-02', 2.0, 2.0),
 ('P2', '13', '2018-04-02', 10.0, 10.0),
 ('A1', '6', '2019-11-02', 4.0, 0.0),
 ('B1', '7', '2018-03-02', 6.0, 6.0),
 ('A7', '3', '2020-01-02', 8.0, 0.0),
 ('B1', '8', '2019-03-02', 2.0, 2.0),
 ('B6', '4', '2017-05-02', 5.0, 5.0),
 ('P7', '9', '2020-02-11', 2.0, 0.0)]

In [43]:
%%sql
INSERT INTO items_of_author
VALUES ('AU1','B1'),
('AU2','B2'),
('AU3','B3'),
('AU4','B4'),
('AU5','B5'),
('AU6','B6'),
('AU7','B7'),
('AU8','B8'),
('AU9','B9'),
('AU10','B11');

 * sqlite:///library.db
10 rows affected.

[]

In [44]:
%%sql 

SELECT * FROM items_of_author ;

 * sqlite:///library.db
Done.

[('AU1', 'B1'),
 ('AU2', 'B2'),
 ('AU3', 'B3'),
 ('AU4', 'B4'),
 ('AU5', 'B5'),
 ('AU6', 'B6'),
 ('AU7', 'B7'),
 ('AU8', 'B8'),
 ('AU9', 'B9'),
 ('AU10', 'B11')]

In [45]:
%%sql
INSERT INTO Items_of_Publisher
VALUES ('PU1','P1'),
('PU2','P2'),
('PU3','P3'),
('PU4','P4'),
('PU5','P5'),
('PU6','P6'),
('PU7','P7'),
('PU8','P8'),
('PU9','P9'),
('PU11','P11');

 * sqlite:///library.db
10 rows affected.

[]

In [46]:
%%sql 

SELECT * FROM Items_of_Publisher ;

 * sqlite:///library.db
Done.

[('PU1', 'P1'),
 ('PU2', 'P2'),
 ('PU3', 'P3'),
 ('PU4', 'P4'),
 ('PU5', 'P5'),
 ('PU6', 'P6'),
 ('PU7', 'P7'),
 ('PU8', 'P8'),
 ('PU9', 'P9'),
 ('PU11', 'P11')]

In [47]:
%%sql
INSERT INTO Items_of_Producer
VALUES ('PRO1','A1'),
('PRO2','A2'),
('PRO3','A3'),
('PRO4','A4'),
('PRO5','A5'),
('PRO6','A6'),
('PRO7','A7'),
('PRO8','A8'),
('PRO9','A9'),
('PRO11','A11');

 * sqlite:///library.db
10 rows affected.

[]

In [48]:
%%sql 

SELECT * FROM Items_of_Producer ;

 * sqlite:///library.db
Done.

[('PRO1', 'A1'),
 ('PRO2', 'A2'),
 ('PRO3', 'A3'),
 ('PRO4', 'A4'),
 ('PRO5', 'A5'),
 ('PRO6', 'A6'),
 ('PRO7', 'A7'),
 ('PRO8', 'A8'),
 ('PRO9', 'A9'),
 ('PRO11', 'A11')]

In [49]:
%%sql
INSERT INTO Items_of_Artist
VALUES ('ART1','A1'),
('ART2','A2'),
('ART3','A3'),
('ART4','A4'),
('ART5','A5'),
('ART6','A6'),
('ART7','A7'),
('ART8','A8'),
('ART9','A9'),
('ART11','A11');

 * sqlite:///library.db
10 rows affected.

[]

In [50]:
%%sql 

SELECT * FROM Items_of_Artist ;

 * sqlite:///library.db
Done.

[('ART1', 'A1'),
 ('ART2', 'A2'),
 ('ART3', 'A3'),
 ('ART4', 'A4'),
 ('ART5', 'A5'),
 ('ART6', 'A6'),
 ('ART7', 'A7'),
 ('ART8', 'A8'),
 ('ART9', 'A9'),
 ('ART11', 'A11')]

In [51]:
%%sql
INSERT INTO Event_by_Organizer
VALUES ('daveed@me.com','Book review of Amazing Amy'),
('bwcarty@yahoo.ca','Book review of Happy Housecat'),
('lstaf@mac.com','Book review of An Adventure City 3'),
('ournews@yahoo.ca', 'Gone with the wind'),
('dbindel@verizon.net','Home Alone 1'),
('hllam@optonline.net','Hexagonals'),
('rsteiner@optonline.net','Man and Machine'),
('mgreen@sbcglobal.net','Writing Essays'),
('hoangle@gmail.com','Meet and Greet with Library Personnel'),
('psichel@me.com','Community meet');

 * sqlite:///library.db
10 rows affected.

[]

In [52]:
%%sql 

SELECT * FROM Event_by_Organizer ;

 * sqlite:///library.db
Done.

[('daveed@me.com', 'Book review of Amazing Amy'),
 ('bwcarty@yahoo.ca', 'Book review of Happy Housecat'),
 ('lstaf@mac.com', 'Book review of An Adventure City 3'),
 ('ournews@yahoo.ca', 'Gone with the wind'),
 ('dbindel@verizon.net', 'Home Alone 1'),
 ('hllam@optonline.net', 'Hexagonals'),
 ('rsteiner@optonline.net', 'Man and Machine'),
 ('mgreen@sbcglobal.net', 'Writing Essays'),
 ('hoangle@gmail.com', 'Meet and Greet with Library Personnel'),
 ('psichel@me.com', 'Community meet')]